garyPenhook/PyAvrOCD/svd/avr16du20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TWI0</name>
      <description>Two-Wire Interface</description>
      <baseAddress>0x00800900</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMPEN</name>
              <description>Fast-mode Plus Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Operating in Standard-mode or Fast-mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Operating in Fast-mode Plus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDAHOLD</name>
              <description>SDA Hold Time</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No SDA Hold Delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50NS</name>
                  <description>Short SDA hold time</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>300NS</name>
                  <description>Meets SMBUS 2.0 specification under typical conditions</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500NS</name>
                  <description>Meets SMBUS 2.0 specificaiton across all corners</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDASETUP</name>
              <description>SDA Setup Time</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4CYC</name>
                  <description>SDA setup time is four clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CYC</name>
                  <description>SDA setup time is eight clock cycle</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUTLVL</name>
              <description>Input voltage transition level</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>I2C input voltage transition level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMBUS</name>
                  <description>SMBus 3.0 input voltage transition level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>The peripheral is halted in Break Debug mode and ignores events</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>The peripheral will continue to run in Break Debug mode when the CPU is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR</name>
          <description>Host Address</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MBAUD</name>
          <description>Host Baud Rate</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAUD</name>
              <description>Baud Rate</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRLA</name>
          <description>Host Control A</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMEN</name>
              <description>Smart Mode Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Inactive Bus Time-Out</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Bus time-out disabled. I2C.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50US</name>
                  <description>50us - SMBus</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100US</name>
                  <description>100us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200US</name>
                  <description>200us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QCEN</name>
              <description>Quick Command Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WIEN</name>
              <description>Write Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RIEN</name>
              <description>Read Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRLB</name>
          <description>Host Control B</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCMD</name>
              <description>Command</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPSTART</name>
                  <description>Execute Acknowledge Action followed by repeated Start.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECVTRANS</name>
                  <description>Execute Acknowledge Action followed by a byte read/write operation. Read/write is defined by DIR.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Execute Acknowledge Action followed by issuing a Stop condition.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKACT</name>
              <description>Acknowledge Action</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>Send ACK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACK</name>
                  <description>Send NACK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDATA</name>
          <description>Host Data</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTATUS</name>
          <description>Host STATUS</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSSTATE</name>
              <description>Bus State</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN</name>
                  <description>Unknown bus state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Bus is idle</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OWNER</name>
                  <description>This TWI controls the bus</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>The bus is busy</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSERR</name>
              <description>Bus Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLOST</name>
              <description>Arbitration Lost</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXACK</name>
              <description>Received Acknowledge</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKHOLD</name>
              <description>Clock Hold</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WIF</name>
              <description>Write Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RIF</name>
              <description>Read Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR</name>
          <description>Client Address</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDRMASK</name>
          <description>Client Address Mask</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDREN</name>
              <description>Address Mask Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRMASK</name>
              <description>Address Mask</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRLA</name>
          <description>Client Control A</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMEN</name>
              <description>Smart Mode Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMEN</name>
              <description>Address Recognition Mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PIEN</name>
              <description>Stop Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APIEN</name>
              <description>Address or Stop Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIEN</name>
              <description>Data Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRLB</name>
          <description>Client Control B</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCMD</name>
              <description>Command</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPTRANS</name>
                  <description>Complete transaction</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESPONSE</name>
                  <description>Used in response to an interrupt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKACT</name>
              <description>Acknowledge Action</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>Send ACK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACK</name>
                  <description>Send NACK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDATA</name>
          <description>Client Data</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
